5final/board_without_scaffold/app/controllers/comments_controller.rb

  def create
    #@my_thread.comments.create(comment_params)
    @comment = current_user.comments.build(body: comment_params[:body], my_thread: @my_thread)
    @comment.save
---
INSERT INTO `comments` (`body`, `my_thread_id`, `created_at`, `updated_at`, `user_id`) VALUES ('Hi bob', 4, '2021-08-31 11:21:30.731655', '2021-08-31 11:21:30.731655', 2)

  def update
    if current_user.id == @comment.user_id
      if @comment.update(comment_params)
---
UPDATE `comments` SET `comments`.`body` = 'Hi bob aaa', `comments`.`updated_at` = '2021-08-31 11:22:52.491265' WHERE `comments`.`id` = 1

  def destroy
    if current_user.id == @comment.user_id
      @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 8

    def set_my_thread
      @my_thread = MyThread.find(params[:my_thread_id])
---
SELECT `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 4 LIMIT 1

    def set_comment
      # @comment = @my_thread.comments.find(params[:id])
      @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1