5final/board_without_scaffold/app/controllers/my_threads_controller.rb

SELECT `my_threads`.* FROM `my_threads`
---
  def index
    @my_threads = MyThread.all

INSERT INTO `my_threads` (`title`, `created_at`, `updated_at`, `user_id`) VALUES ('title10', '2021-08-31 10:49:15.832016', '2021-08-31 10:49:15.832016', 1)
---
  def create
    #@my_thread = MyThread.create(my_thread_params)
    #@my_thread = MyThread.new(my_thread_params)
    @my_thread = current_user.my_threads.build(my_thread_params)
    if @my_thread.save

UPDATE `my_threads` SET `my_threads`.`title` = 'title4', `my_threads`.`updated_at` = '2021-08-30 13:28:36.034041' WHERE `my_threads`.`id` = 12
---
  def update
    if current_user.id == @my_thread.user_id
      if @my_thread.update(my_thread_params)

DELETE FROM `my_threads` WHERE `my_threads`.`id` = 6
---
  def destroy
    if current_user.id == @my_thread.user_id
      @my_thread.destroy

SELECT `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 7 LIMIT 1
---
    def set_my_thread
      @my_thread = MyThread.find(params[:id])