5final/board_without_scaffold/app/views/my_threads/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 12
SELECT 1 AS one FROM `comments` WHERE `comments`.`my_thread_id` = 2 LIMIT 1
---

<% if @my_thread.comments.any? %>

SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 2
---
    <tbody>
      <% @my_thread.comments.each do |comment| %>