5final/board_scaffold/app/views/my_threads/show.html.erb


<% if @my_thread.comments.any? %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 1
SELECT 1 AS one FROM `comments` WHERE `comments`.`my_thread_id` = 1 LIMIT 1

    <tbody>
      <% @my_thread.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 1