5final/board_scaffold/app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `my_thread_id`, `created_at`, `updated_at`) VALUES ('aaa', 1, '2021-08-30 18:01:44.366258', '2021-08-30 18:01:44.366258')
---
  def create
    #@my_thread = MyThread.find(params[:my_thread_id])
    @my_thread.comments.create(comment_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def edit
    #binding.pry
    #@my_thread = MyThread.find(params[:my_thread_id])
    @comment = Comment.find(params[:id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 1 AND `comments`.`id` = 5 LIMIT 1
UPDATE `comments` SET `comments`.`body` = 'bbbb', `comments`.`updated_at` = '2021-08-29 07:32:53.598199' WHERE `comments`.`id` = 5
---
  def update
    #@my_thread = MyThread.find(params[:my_thread_id])
    @comment = @my_thread.comments.find(params[:id])
    #@comment = Comment.find(params[:id])
    if @comment.update(comment_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`my_thread_id` = 1 AND `comments`.`id` = 4 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 4
---
  def destroy
    #@my_thread = MyThread.find(params[:my_thread_id])
    @comment = @my_thread.comments.find(params[:id])
    @comment.destroy

SELECT `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1
---
    def set_my_thread
      @my_thread = MyThread.find(params[:my_thread_id])