5final/board_scaffold/app/controllers/my_threads_controller.rb

  def index
    @my_threads = MyThread.all
---
SELECT `my_threads`.* FROM `my_threads`

  def create
    @my_thread = MyThread.new(my_thread_params)

    respond_to do |format|
      if @my_thread.save
---
INSERT INTO `my_threads` (`title`, `created_at`, `updated_at`) VALUES ('Title10', '2021-08-30 08:33:12.840458', '2021-08-30 08:33:12.840458')

  def update
    respond_to do |format|
      if @my_thread.update(my_thread_params)
---
UPDATE `my_threads` SET `my_threads`.`title` = 'title2 updated', `my_threads`.`updated_at` = '2021-08-29 07:31:09.228013' WHERE `my_threads`.`id` = 2

  def destroy
    @my_thread.destroy
---
DELETE FROM `my_threads` WHERE `my_threads`.`id` = 2

    def set_my_thread
      @my_thread = MyThread.find(params[:id])
---
SELECT `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1